{
  "nodes": [
    {
      "op": "null", 
      "name": "ngram_features-F03vpUuT3e", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_garage_weight", 
      "attrs": {"num_hidden": "101"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_garage_bias", 
      "attrs": {"num_hidden": "101"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_garage", 
      "attrs": {"num_hidden": "101"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax8", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "garage", 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar16", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar24", 
      "attrs": {"scalar": "101"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser8", 
      "inputs": [[6, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul24", 
      "inputs": [[6, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split8", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "pick", 
      "name": "pick16", 
      "inputs": [[5, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar17", 
      "attrs": {"scalar": "-1"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like8", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater8", 
      "inputs": [[11, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul25", 
      "inputs": [[13, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "__empirical_risk_instance_weight__", 
      "inputs": []
    }, 
    {
      "op": "pick", 
      "name": "pick17", 
      "inputs": [[17, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul26", 
      "inputs": [[16, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum16", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar25", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div16", 
      "inputs": [[19, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like8", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum17", 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul16", 
      "inputs": [[22, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean8", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar26", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div17", 
      "inputs": [[25, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum17", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar17", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum16", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar16", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul17", 
      "inputs": [[30, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss8", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax8", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-garage", 
      "inputs": [[35, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 3, 6, 17], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37
  ], 
  "heads": [[34, 0, 0], [36, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}